lixpaulian/efr32xx-rail/platform/emlib/inc/em_ldma.h
/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/**
 * @brief
 *   DMA descriptor.
 * @details
 *   The LDMA DMA controller supports three different DMA descriptors. Each
 *   consist of four WORD's which map directly onto hw control registers for a
 *   given DMA channel. The three descriptor types are XFER, SYNC and WRI.
 *   Refer to the reference manual for further information.
 */
typedef union {
  /**
   *  TRANSFER DMA descriptor, this is the only descriptor type which can be
   *  used to start a DMA transfer.
   */
  struct {
    uint32_t  structType : 2;   /**< Set to 0 to select XFER descriptor type. */
    uint32_t  reserved0  : 1;
    uint32_t  structReq  : 1;   /**< DMA transfer trigger during LINKLOAD.    */
    uint32_t  xferCnt    : 11;  /**< Transfer count minus one.                */
    uint32_t  byteSwap   : 1;   /**< Enable byte swapping transfers.          */
    uint32_t  blockSize  : 4;   /**< Number of unit transfers per arb. cycle. */
    uint32_t  doneIfs    : 1;   /**< Generate interrupt when done.            */
    uint32_t  reqMode    : 1;   /**< Block or cycle transfer selector.        */
    uint32_t  decLoopCnt : 1;   /**< Enable looped transfers.                 */
    uint32_t  ignoreSrec : 1;   /**< Ignore single requests.                  */
    uint32_t  srcInc     : 2;   /**< Source address increment unit size.      */
    uint32_t  size       : 2;   /**< DMA transfer unit size.                  */
    uint32_t  dstInc     : 2;   /**< Destination address increment unit size. */
    uint32_t  srcAddrMode : 1;  /**< Source addressing mode.                  */
    uint32_t  dstAddrMode : 1;  /**< Destination addressing mode.             */

    uint32_t  srcAddr;          /**< DMA source address.                      */
    uint32_t  dstAddr;          /**< DMA destination address.                 */

    uint32_t  linkMode   : 1;   /**< Select absolute or relative link address.*/
    uint32_t  link       : 1;   /**< Enable LINKLOAD when transfer is done.   */
    int32_t   linkAddr   : 30;  /**< Address of next (linked) descriptor.     */
  } xfer;

  /** SYNCHRONIZE DMA descriptor, used for intra channel transfer
   *  syncronization.
   */
  struct {
    uint32_t  structType : 2;   /**< Set to 1 to select SYNC descriptor type. */
    uint32_t  reserved0  : 1;
    uint32_t  structReq  : 1;   /**< DMA transfer trigger during LINKLOAD.    */
    uint32_t  xferCnt    : 11;  /**< Transfer count minus one.                */
    uint32_t  byteSwap   : 1;   /**< Enable byte swapping transfers.          */
    uint32_t  blockSize  : 4;   /**< Number of unit transfers per arb. cycle. */
    uint32_t  doneIfs    : 1;   /**< Generate interrupt when done.            */
    uint32_t  reqMode    : 1;   /**< Block or cycle transfer selector.        */
    uint32_t  decLoopCnt : 1;   /**< Enable looped transfers.                 */
    uint32_t  ignoreSrec : 1;   /**< Ignore single requests.                  */
    uint32_t  srcInc     : 2;   /**< Source address increment unit size.      */
    uint32_t  size       : 2;   /**< DMA transfer unit size.                  */
    uint32_t  dstInc     : 2;   /**< Destination address increment unit size. */
    uint32_t  srcAddrMode : 1;  /**< Source addressing mode.                  */
    uint32_t  dstAddrMode : 1;  /**< Destination addressing mode.             */

    uint32_t  syncSet    : 8;   /**< Set bits in LDMA_CTRL.SYNCTRIG register. */
    uint32_t  syncClr    : 8;   /**< Clear bits in LDMA_CTRL.SYNCTRIG register*/
    uint32_t  reserved3  : 16;
    uint32_t  matchVal   : 8;   /**< Sync trig match value.                   */
    uint32_t  matchEn    : 8;   /**< Sync trig match enable.                  */
    uint32_t  reserved4  : 16;

    uint32_t  linkMode   : 1;   /**< Select absolute or relative link address.*/
    uint32_t  link       : 1;   /**< Enable LINKLOAD when transfer is done.   */
    int32_t   linkAddr   : 30;  /**< Address of next (linked) descriptor.     */
  } sync;

  /** WRITE DMA descriptor, used for write immediate operations.              */
  struct {
    uint32_t  structType : 2;   /**< Set to 2 to select WRITE descriptor type.*/
    uint32_t  reserved0  : 1;
    uint32_t  structReq  : 1;   /**< DMA transfer trigger during LINKLOAD.    */
    uint32_t  xferCnt    : 11;  /**< Transfer count minus one.                */
    uint32_t  byteSwap   : 1;   /**< Enable byte swapping transfers.          */
    uint32_t  blockSize  : 4;   /**< Number of unit transfers per arb. cycle. */
    uint32_t  doneIfs    : 1;   /**< Generate interrupt when done.            */
    uint32_t  reqMode    : 1;   /**< Block or cycle transfer selector.        */
    uint32_t  decLoopCnt : 1;   /**< Enable looped transfers.                 */
    uint32_t  ignoreSrec : 1;   /**< Ignore single requests.                  */
    uint32_t  srcInc     : 2;   /**< Source address increment unit size.      */
    uint32_t  size       : 2;   /**< DMA transfer unit size.                  */
    uint32_t  dstInc     : 2;   /**< Destination address increment unit size. */
    uint32_t  srcAddrMode : 1;  /**< Source addressing mode.                  */
    uint32_t  dstAddrMode : 1;  /**< Destination addressing mode.             */

    uint32_t  immVal;           /**< Data to be written at dstAddr.           */
    uint32_t  dstAddr;          /**< DMA write destination address.           */

    uint32_t  linkMode   : 1;   /**< Select absolute or relative link address.*/
    uint32_t  link       : 1;   /**< Enable LINKLOAD when transfer is done.   */
    int32_t   linkAddr   : 30;  /**< Address of next (linked) descriptor.     */
  } wri;
} LDMA_Descriptor_t;

/** @brief LDMA initialization configuration structure. */
typedef struct {
  uint8_t               ldmaInitCtrlNumFixed;     /**< Arbitration mode separator.*/
  uint8_t               ldmaInitCtrlSyncPrsClrEn; /**< PRS Synctrig clear enable. */
  uint8_t               ldmaInitCtrlSyncPrsSetEn; /**< PRS Synctrig set enable.   */
  uint8_t               ldmaInitIrqPriority;      /**< LDMA IRQ priority (0..7).  */
} LDMA_Init_t;

/**
 * @brief
 *   DMA transfer configuration structure.
 * @details
 *   This struct configures all aspects of a DMA transfer.
 */
typedef struct {
  uint32_t              ldmaReqSel;            /**< Selects DMA trigger source.          */
  uint8_t               ldmaCtrlSyncPrsClrOff; /**< PRS Synctrig clear enables to clear. */
  uint8_t               ldmaCtrlSyncPrsClrOn;  /**< PRS Synctrig clear enables to set.   */
  uint8_t               ldmaCtrlSyncPrsSetOff; /**< PRS Synctrig set enables to clear.   */
  uint8_t               ldmaCtrlSyncPrsSetOn;  /**< PRS Synctrig set enables to set.     */
  bool                  ldmaReqDis;            /**< Mask the PRS trigger input.          */
  bool                  ldmaDbgHalt;           /**< Dis. DMA trig when cpu is halted.    */
  uint8_t               ldmaCfgArbSlots;       /**< Arbitration slot number.             */
  uint8_t               ldmaCfgSrcIncSign;     /**< Source addr. increment sign.         */
  uint8_t               ldmaCfgDstIncSign;     /**< Dest. addr. increment sign.          */
  uint8_t               ldmaLoopCnt;           /**< Counter for looped transfers.        */
} LDMA_TransferCfg_t;

